# ============ #
#              #
#  Переменные  #
#              #
# ============ #


# Основа

var = 5
arr = [ 1, 2, 3 ]


# Простые


# Числовые

# Целочисленные

int1 = 1
int2 = 100
int3 = 10000

# Вещественные

float1 = 2.15
float2 = 3.14
float3 = 2.28

# Комлесные

complex1 = 2 + 2j
complex2 = 1j
complex3 = 45 + 0j


# Строковые

str1 = "a"
str2 = "abc"
str3 = "abc abc"


# Логические

bool1 = True
bool2 = False


# Сложные / комплексные


# Список

list1 = [ 1, 2, 3, 4, 5 ]
list2 = [ "a", "b", "c" ]
list3 = [ 1, "a", True  ]
list4 = [ [ 1, 2, 3 ], 1 ]
list5 = [
	[ 1, 2, 3 ],
	[ 4, 5, 6 ],
	[ 7, 8, 9 ]
]


# Словарь

dict1 = {
	"key"  : "value",
	"ключ" : "значение"
}
dict2 = { 2: 2, 1: 3, 4: 2 }
dict3 = { 1: "a", "b": 2, 3: True }


# Кортеж

tuple1 = ( 1, 2, 3, 4, 5 )
tuple2 = ( "a", "b", "c" )
tuple3 = ( 1, "a", True  )


# Множество

set1 = { 1, 2, 3, 4, 5 }
set2 = { "a", "b", "c" }
set3 = { 1, "a", True  }
